<h1 id="tocheading">Table of Contents</h1>
<div id="toc"></div>

In [131]:
%%javascript
$.getScript('https://kmahelona.github.io/ipython_notebook_goodies/ipython_notebook_toc.js')

In [132]:
!jupyter labextension install @jupyterlab/toc

Building jupyterlab assets (build:prod:minimize)

In [133]:
#!conda install -c conda-forge jupyter_contrib_nbextensions -y

# Course Outline 
This course will provide students with an understanding of how to reshape their data using pandas. It will cover pivoting, melting, and stacking and unstacking. It should serve as the parallel course to Reshaping Data with tidyr.

## What problem(s) will students learn how to solve?

Students will learn how to transform the structure of their data in a table (i.e dataframe or series).
Perhaps your DataFrame has a separate column for each year but what you need is a single column that contains the year. This is where we can reshape our data.

Depending on the data sources and how you are going to use the data, you may see data in either wide or long format.
Data reshaping means the transforming the structure of a table (i.e. DataFrame or Series) to make it suitable or rahter easy for analysis.
Meaning we get to shift and massage the data and view it from differnt angels if you will. 

Moving columns to rows and viseversa.


The concept of stacking comes in handy when we have data with multi indices. Using Pandas stack() function, we can reshape the dataframe by converting the data into a stacked form, which means converting (also called rotating or pivoting) the innermost column index into the innermost row index. Unstacking, as the name implies, does exactly the inverse operation — it will convert the innermost row index back into the innermost column index.

You can think of stacking as piling up data on top of each other, and unstacking as spreading out our data.

At a very high level whithout getting into the details, we can think of stacking as rotating our data and in the next few chapters we get to play with our data and see how it looks.

## What techniques or concepts will students learn?

We learn about pandas stacking, unstacking and of course melting techniques to shape our data.

As we said before, Stacking means moving (also rotating or pivoting) the innermost column index to become the innermost row index. The inverse operation is called unstacking. It means moving the innermost row index to become the innermost column index. 
Sounds complicted but it is not. 


Lets take a look at a picture:

Source: 

<sup>https://nikgrozev.com/2015/07/01/reshaping-in-pandas-pivot-pivot-table-stack-and-unstack-explained-with-pictures/ </sup>


![title](https://miro.medium.com/max/1400/0*xygBiATSiXlreNWV)

In [135]:
import pandas as pd
df_long = pd.read_csv("applesampledata.csv")
df_long

         date ticker variable  value
0  2020-04-18   AAPL     open    275
1  2020-04-18   AAPL    close    280
2  2020-04-19   AAPL     open    284
3  2020-04-19   AAPL    close    286

### Changing Long to Wide. unstack()

In [112]:
# The columns of our new dataframe will be "open", and "close". We are picking these values from the variable column in the previous table.
# Note the ticket aapl is now missing but the good news is that we are not repeating ourselves with showing the open and close in each row.
# Wide format in its traditional format does not support multi level of higharchy.
# we can see how to get around it later on.

df_long.pivot(index='date', columns='variable', values='value')

variable    close  open
date
2020-04-18    280   275
2020-04-19    286   284

In [123]:
# We can use the unstack() function of pandas to create a wide format with multiple ID columns
# As you see, we got our ticker back. 
df_wide = df_long.set_index(['ticker', 'date', 'variable']).unstack()
df_wide

                  value
variable          close open
ticker date
AAPL   2020-04-18   280  275
       2020-04-19   286  284

In [124]:
# and to go back to the long format or stack() if you will, recall, stacking is like piling up data on top of each other.
df_long.set_index(['ticker', 'date', 'variable'])
# now this is very similar to the last table except that we are again seeing our open and close variable repeating in our dataframe
# we can now use the unstack() function to pivot or pull out the variables (open and close) and place them as a title of columns

                            value
ticker date       variable
AAPL   2020-04-18 open        275
                  close       280
       2020-04-19 open        284
                  close       286

In [125]:
df_long_index = df_long.set_index(['ticker', 'date', 'variable'])
df_long_index

# you may ask why the values in the variable column (open and close) is not the column headers? How does pandas know to pick the 
# these values?
# unstack() by default picks up the innter most column which in this case is the variable column and pulls the values to use them 
# as column titles. 
# Perhaps I can show that with some kind of animation.

                            value
ticker date       variable
AAPL   2020-04-18 open        275
                  close       280
       2020-04-19 open        284
                  close       286

In [126]:
# the default for unstack function is to take the inner most column and pivot against it.
df_long_index.unstack()

                  value
variable          close open
ticker date
AAPL   2020-04-18   280  275
       2020-04-19   286  284

In [127]:
# if we want to pivot based on another column for example the date column, we an specifiy it as passing an arguemnt to the unstack function
# now in our columns we have the dates that used to be the index in our rows.
df_long_index.unstack('date')

                     value
date            2020-04-18 2020-04-19
ticker variable
AAPL   close           280        286
       open            275        284

### Wide to Long using stack()
The inverse operation of unstack function is, you guess it, stack(). Which as we said before is stacking or piling up our data in long
format.
stack() function will take values from the colum and moves them into the index

In [118]:
df_wide

                  value
variable          close open
ticker date
AAPL   2020-04-18   280  275
       2020-04-19   286  284

In [119]:
df_wide.stack()

                            value
ticker date       variable
AAPL   2020-04-18 close       280
                  open        275
       2020-04-19 close       286
                  open        284

In [120]:
# if we want to get back to the original shape of our dateframe we can call the reset_index() function on the stack()
# and voila
df_wide.stack().reset_index()

  ticker        date variable  value
0   AAPL  2020-04-18    close    280
1   AAPL  2020-04-18     open    275
2   AAPL  2020-04-19    close    286
3   AAPL  2020-04-19     open    284

# Another Example using NBA dataset

In [136]:
# making dataframe 
df_nba = pd.read_csv("nba-data.csv") 
df_nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [137]:
# reshape the dataframe using stack() method 
# here we are simply reshaping our dataframe from the wide to long format
df_stacked = df_nba.stack() 
df_stacked

0    Name         Avery Bradley
     Team        Boston Celtics
     Number                   0
     Position                PG
     Age                     25
                      ...
456  Age                     26
     Height                 7-0
     Weight                 231
     College             Kansas
     Salary              947276
Length: 4018, dtype: object

In [138]:
# and back to the wide format
df_stacked.unstack()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,6-2,180,Texas,7.73034e+06
1,Jae Crowder,Boston Celtics,99,SF,25,6-6,235,Marquette,6.79612e+06
2,John Holland,Boston Celtics,30,SG,27,6-5,205,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28,SG,22,6-5,185,Georgia State,1.14864e+06
4,Jonas Jerebko,Boston Celtics,8,PF,29,6-10,231,NaN,5e+06
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41,PF,20,6-10,234,Kentucky,2.2398e+06
453,Shelvin Mack,Utah Jazz,8,PG,26,6-3,203,Butler,2.43333e+06
454,Raul Neto,Utah Jazz,25,PG,24,6-1,179,NaN,900000
455,Tibor Pleiss,Utah Jazz,21,C,26,7-3,256,NaN,2.9e+06
456,Jeff Withey,Utah Jazz,24,C,26,7-0,231,Kansas,947276

# melt() function

With the melt() function we can specify which columns we want to keep as column and the remaining will be converted to long format.
Here with id_vars, we can nail the columns we want to our dataframe, meaning, don't change these columns, but the other columns will be converted
to a long format.
The column "name" in this case will be repeated as well as the 'team' column
But all other columns after the 'team will be listed in a under the variable column header' with their corresponding values off to the right.

In [101]:
df_nba_melt = df_nba.melt(id_vars =['Name', 'Team'])  
df_nba_melt

               Name            Team variable        value
0     Avery Bradley  Boston Celtics   Number            0
1       Jae Crowder  Boston Celtics   Number           99
2      John Holland  Boston Celtics   Number           30
3       R.J. Hunter  Boston Celtics   Number           28
4     Jonas Jerebko  Boston Celtics   Number            8
...             ...             ...      ...          ...
3201   Shelvin Mack       Utah Jazz   Salary  2.43333e+06
3202      Raul Neto       Utah Jazz   Salary       900000
3203   Tibor Pleiss       Utah Jazz   Salary      2.9e+06
3204    Jeff Withey       Utah Jazz   Salary       947276
3205            NaN             NaN   Salary          NaN

[3206 rows x 4 columns]

In [142]:
# making dataframe 
df_nations = pd.read_csv("nations.csv") 
df_nations.head(5)

,iso2c,iso3c,country,year,gdp_percap,population,birth_rate,neonat_mortal_rate,region,income
0,AD,AND,Andorra,1996,NaN,64291.0,10.9,2.8,Europe & Central Asia,High income
1,AD,AND,Andorra,1994,NaN,62707.0,10.9,3.2,Europe & Central Asia,High income
2,AD,AND,Andorra,2003,NaN,74783.0,10.3,2.0,Europe & Central Asia,High income
3,AD,AND,Andorra,1990,NaN,54511.0,11.9,4.3,Europe & Central Asia,High income
4,AD,AND,Andorra,2009,NaN,85474.0,9.9,1.7,Europe & Central Asia,High income

In [143]:
df_nations.columns

Index(['iso2c', 'iso3c', 'country', 'year', 'gdp_percap', 'population',
       'birth_rate', 'neonat_mortal_rate', 'region', 'income'],
      dtype='object')

In [144]:
df_nations_melt = df_nations.melt(id_vars=['country', 'year'],
                                  var_name='region',
                                  value_name='values'
                                 ).sort_values(by=['country', 'year'])
df_nations_melt

           country  year              region              values
69     Afghanistan  1990               iso2c                  AF
5344   Afghanistan  1990               iso3c                 AFG
10619  Afghanistan  1990          gdp_percap                 NaN
15894  Afghanistan  1990          population         1.20676e+07
21169  Afghanistan  1990          birth_rate              49.029
...            ...   ...                 ...                 ...
21099     Zimbabwe  2014          population         1.52459e+07
26374     Zimbabwe  2014          birth_rate              35.189
31649     Zimbabwe  2014  neonat_mortal_rate                23.9
36924     Zimbabwe  2014              region  Sub-Saharan Africa
42199     Zimbabwe  2014              income          Low income

[42200 rows x 4 columns]

# Simple Example of stack() unstack()

In [154]:
row_labels = ['one', 'two', 'three', 'four', 'five', 'six', 'seven']
df = pd.DataFrame({'A': [1, 2, 3, 4, 5 , 6,7],
                   'B':[3, 4, 5, 6, 6,7,33],
                   'C':[9, 4, 44, 2, 12,5,12]},
                  index=row_labels)
df

       A   B   C
one    1   3   9
two    2   4   4
three  3   5  44
four   4   6   2
five   5   6  12
six    6   7   5
seven  7  33  12

In [155]:
df.stack()

one    A     1
       B     3
       C     9
two    A     2
       B     4
       C     4
three  A     3
       B     5
       C    44
four   A     4
       B     6
       C     2
five   A     5
       B     6
       C    12
six    A     6
       B     7
       C     5
seven  A     7
       B    33
       C    12
dtype: int64

In [164]:
df.unstack()

A  one       1
   two       2
   three     3
   four      4
   five      5
   six       6
   seven     7
B  one       3
   two       4
   three     5
   four      6
   five      6
   six       7
   seven    33
C  one       9
   two       4
   three    44
   four      2
   five     12
   six       5
   seven    12
dtype: int64

In [7]:
import pandas as pd
df = pd.read_excel("stocks.xlsx",header=[0,1])
df

  Unnamed: 0_level_0    Price                  Price to earnings ratio (P/E)  \
             Company Facebook Google Microsoft                      Facebook
0         2017-06-05      155    955        66                         37.10
1         2017-06-06      150    987        69                         36.98
2         2017-06-07      153    963        62                         36.78
3         2017-06-08      155   1000        61                         36.11
4         2017-06-09      156   1012        66                         37.07


  Google Microsoft
0   32.0     30.31
1   31.3     30.56
2   31.7     30.46
3   31.2     30.11
4   30.0     31.00

In [22]:
df.stack()
# this will take the inner most column header and stack it on top of each other.
# what is that mean inner most level?
# In our case the inner most level is the row where we have company, Facebook, google, etc...
# that is our inner most level.
# We will look at a few example to find out how this really works.

# lets see how this will look

              Price  Price to earnings ratio (P/E) Unnamed: 0_level_0
0 Company       NaN                            NaN         2017-06-05
  Facebook    155.0                          37.10                NaT
  Google      955.0                          32.00                NaT
  Microsoft    66.0                          30.31                NaT
1 Company       NaN                            NaN         2017-06-06
  Facebook    150.0                          36.98                NaT
  Google      987.0                          31.30                NaT
  Microsoft    69.0                          30.56                NaT
2 Company       NaN                            NaN         2017-06-07
  Facebook    153.0                          36.78                NaT
  Google      963.0                          31.70                NaT
  Microsoft    62.0                          30.46                NaT
3 Company       NaN                            NaN         2017-06-08
  Facebook    155.0                          36.11                NaT
  Google     1000.0                          31.20                NaT
  Microsoft    61.0                          30.11                NaT
4 Company       NaN                            NaN         2017-06-09
  Facebook    156.0                          37.07                NaT
  Google     1012.0                          30.00                NaT
  Microsoft    66.0                          31.00                NaT

In [10]:
# Now if you want to instead take "Price to earnings ratio (P/E)" you have to specify the level
df.stack(level=0)

                                   Company  Facebook  Google  Microsoft
0 Price                                NaT    155.00   955.0      66.00
  Price to earnings ratio (P/E)        NaT     37.10    32.0      30.31
  Unnamed: 0_level_0            2017-06-05       NaN     NaN        NaN
1 Price                                NaT    150.00   987.0      69.00
  Price to earnings ratio (P/E)        NaT     36.98    31.3      30.56
  Unnamed: 0_level_0            2017-06-06       NaN     NaN        NaN
2 Price                                NaT    153.00   963.0      62.00
  Price to earnings ratio (P/E)        NaT     36.78    31.7      30.46
  Unnamed: 0_level_0            2017-06-07       NaN     NaN        NaN
3 Price                                NaT    155.00  1000.0      61.00
  Price to earnings ratio (P/E)        NaT     36.11    31.2      30.11
  Unnamed: 0_level_0            2017-06-08       NaN     NaN        NaN
4 Price                                NaT    156.00  1012.0      66.00
  Price to earnings ratio (P/E)        NaT     37.07    30.0      31.00
  Unnamed: 0_level_0            2017-06-09       NaN     NaN        NaN

In [11]:
df.stack(level=1)

              Price  Price to earnings ratio (P/E) Unnamed: 0_level_0
0 Company       NaN                            NaN         2017-06-05
  Facebook    155.0                          37.10                NaT
  Google      955.0                          32.00                NaT
  Microsoft    66.0                          30.31                NaT
1 Company       NaN                            NaN         2017-06-06
  Facebook    150.0                          36.98                NaT
  Google      987.0                          31.30                NaT
  Microsoft    69.0                          30.56                NaT
2 Company       NaN                            NaN         2017-06-07
  Facebook    153.0                          36.78                NaT
  Google      963.0                          31.70                NaT
  Microsoft    62.0                          30.46                NaT
3 Company       NaN                            NaN         2017-06-08
  Facebook    155.0                          36.11                NaT
  Google     1000.0                          31.20                NaT
  Microsoft    61.0                          30.11                NaT
4 Company       NaN                            NaN         2017-06-09
  Facebook    156.0                          37.07                NaT
  Google     1012.0                          30.00                NaT
  Microsoft    66.0                          31.00                NaT

In [21]:
# to reverse this back, we can do unstack to do a reverse transformation
# and we will get out original dataframe back.


df.stack().unstack()

    Price                            Price to earnings ratio (P/E)           \
  Company Facebook  Google Microsoft                       Company Facebook
0     NaN    155.0   955.0      66.0                           NaN    37.10
1     NaN    150.0   987.0      69.0                           NaN    36.98
2     NaN    153.0   963.0      62.0                           NaN    36.78
3     NaN    155.0  1000.0      61.0                           NaN    36.11
4     NaN    156.0  1012.0      66.0                           NaN    37.07

                   Unnamed: 0_level_0
  Google Microsoft            Company Facebook Google Microsoft
0   32.0     30.31         2017-06-05      NaT    NaT       NaT
1   31.3     30.56         2017-06-06      NaT    NaT       NaT
2   31.7     30.46         2017-06-07      NaT    NaT       NaT
3   31.2     30.11         2017-06-08      NaT    NaT       NaT
4   30.0     31.00         2017-06-09      NaT    NaT       NaT

In [24]:
# lets take a look at another example with multiple column headers

Students will learn about stacking, unstacking and melting data. Lets look at a few examples together and see how this works.

In [26]:

df2 = pd.read_excel("stocks_3_levels.xlsx",header=[0,1,2])
df2

  Unnamed: 0_level_0 Price Ratios                   \
  Unnamed: 0_level_1        Price
             Company     Facebook Google Microsoft
0            Q1 2016          155    955        66
1            Q2 2016          150    987        69
2            Q3 2016          153    963        62
3            Q4 2016          155   1000        61
4            Q1 2017          156   1012        66

                                                 Income Statement         \
  Price to earnings ratio (P/E)                         Net Sales
                       Facebook Google Microsoft         Facebook Google
0                         37.10   32.0     30.31              2.6     20
1                         36.98   31.3     30.56              3.1     22
2                         36.78   31.7     30.46              4.3     24
3                         36.11   31.2     30.11              6.7     26
4                         37.07   30.0     31.00              8.1     31


            Net Profit
  Microsoft   Facebook Google Microsoft
0     18.70       0.80   5.43      4.56
1     21.30       0.97   5.89      5.10
2     21.45       1.20   6.10      5.43
3     21.88       1.67   6.50      5.89
4     22.34       2.03   6.40      6.09

In [27]:
df2.stack()

            Income Statement           Price Ratios  \
                  Net Profit Net Sales        Price
0 Company                NaN       NaN          NaN
  Facebook              0.80      2.60        155.0
  Google                5.43     20.00        955.0
  Microsoft             4.56     18.70         66.0
1 Company                NaN       NaN          NaN
  Facebook              0.97      3.10        150.0
  Google                5.89     22.00        987.0
  Microsoft             5.10     21.30         69.0
2 Company                NaN       NaN          NaN
  Facebook              1.20      4.30        153.0
  Google                6.10     24.00        963.0
  Microsoft             5.43     21.45         62.0
3 Company                NaN       NaN          NaN
  Facebook              1.67      6.70        155.0
  Google                6.50     26.00       1000.0
  Microsoft             5.89     21.88         61.0
4 Company                NaN       NaN          NaN
  Facebook              2.03      8.10        156.0
  Google                6.40     31.00       1012.0
  Microsoft             6.09     22.34         66.0

                                          Unnamed: 0_level_0
            Price to earnings ratio (P/E) Unnamed: 0_level_1
0 Company                             NaN            Q1 2016
  Facebook                          37.10                NaN
  Google                            32.00                NaN
  Microsoft                         30.31                NaN
1 Company                             NaN            Q2 2016
  Facebook                          36.98                NaN
  Google                            31.30                NaN
  Microsoft                         30.56                NaN
2 Company                             NaN            Q3 2016
  Facebook                          36.78                NaN
  Google                            31.70                NaN
  Microsoft                         30.46                NaN
3 Company                             NaN            Q4 2016
  Facebook                          36.11                NaN
  Google                            31.20                NaN
  Microsoft                         30.11                NaN
4 Company                             NaN            Q1 2017
  Facebook                          37.07                NaN
  Google                            30.00                NaN
  Microsoft                         31.00                NaN

In [30]:
df2.stack(level=2)

            Income Statement           Price Ratios  \
                  Net Profit Net Sales        Price
0 Company                NaN       NaN          NaN
  Facebook              0.80      2.60        155.0
  Google                5.43     20.00        955.0
  Microsoft             4.56     18.70         66.0
1 Company                NaN       NaN          NaN
  Facebook              0.97      3.10        150.0
  Google                5.89     22.00        987.0
  Microsoft             5.10     21.30         69.0
2 Company                NaN       NaN          NaN
  Facebook              1.20      4.30        153.0
  Google                6.10     24.00        963.0
  Microsoft             5.43     21.45         62.0
3 Company                NaN       NaN          NaN
  Facebook              1.67      6.70        155.0
  Google                6.50     26.00       1000.0
  Microsoft             5.89     21.88         61.0
4 Company                NaN       NaN          NaN
  Facebook              2.03      8.10        156.0
  Google                6.40     31.00       1012.0
  Microsoft             6.09     22.34         66.0

                                          Unnamed: 0_level_0
            Price to earnings ratio (P/E) Unnamed: 0_level_1
0 Company                             NaN            Q1 2016
  Facebook                          37.10                NaN
  Google                            32.00                NaN
  Microsoft                         30.31                NaN
1 Company                             NaN            Q2 2016
  Facebook                          36.98                NaN
  Google                            31.30                NaN
  Microsoft                         30.56                NaN
2 Company                             NaN            Q3 2016
  Facebook                          36.78                NaN
  Google                            31.70                NaN
  Microsoft                         30.46                NaN
3 Company                             NaN            Q4 2016
  Facebook                          36.11                NaN
  Google                            31.20                NaN
  Microsoft                         30.11                NaN
4 Company                             NaN            Q1 2017
  Facebook                          37.07                NaN
  Google                            30.00                NaN
  Microsoft                         31.00                NaN

## What techniques or concepts will students learn?

In [ ]:
we will look at Stack, Unstack functions

## What technologies, packages, or functions will students use?